package com.java.bean;

import javax.validation.constraints.Pattern;

import lombok.Data;

/**
 * 添加出租发布时间Bean
 * @author 温岱
 *
 * 2019年3月24日
 */
@Data
public class AddRentTimeBean {

	/**
	 * 开始时间
	 */
	@Pattern(regexp="(([0-9]{3}[1-9]|[0-9]{2}[1-9][0-9]{1}|[0-9]{1}[1-9][0-9]{2}|[1-9][0-9]{3})-(((0[13578]|1[02])-(0[1-9]|[12][0-9]|3[01]))|((0[469]|11)-(0[1-9]|[12][0-9]|30))|(02-(0[1-9]|[1][0-9]|2[0-8]))))|((([0-9]{2})(0[48]|[2468][048]|[13579][26])|((0[48]|[2468][048]|[3579][26])00))-02-29)",message="日期必须为10个字的字符")
	private String starttime;
	
	/**
	 * 结束时间
	 */
	@Pattern(regexp="(([0-9]{3}[1-9]|[0-9]{2}[1-9][0-9]{1}|[0-9]{1}[1-9][0-9]{2}|[1-9][0-9]{3})-(((0[13578]|1[02])-(0[1-9]|[12][0-9]|3[01]))|((0[469]|11)-(0[1-9]|[12][0-9]|30))|(02-(0[1-9]|[1][0-9]|2[0-8]))))|((([0-9]{2})(0[48]|[2468][048]|[13579][26])|((0[48]|[2468][048]|[3579][26])00))-02-29)",message="日期必须为10个字的字符")
	private String endtime;
	
	/**
	 * 价格
	 */
	@Pattern(regexp="^\\d{0,4}$",message="只能输入万元内")
	private String price;
	
	/**
	 * 车位id
	 */
	private String privatecarsid;
}
